		<fieldset class='history'>
			<legend><em>更新履歴</em></legend>
			<ul>
				<li>2016/07/04 ホームページを開設しました。</li>
				<li>2016/07/09 WebGLのページを追加しました。</li>
				<li>2016/07/10 全体のヘッダーとフッターを調整しました。</li>
				<li>2016/07/11 更新履歴画面を作成しました。</li>
				<li>2016/07/11 各ページからトップページへ飛べるよう、画像のリンクを設定しました。</li>
				<li>2016/07/16 スクラッチ開発ページを追加しました。</li>
				<li>2016/07/23 本ホームページの今後の作成計画を立てました。</li>
				<li>2016/07/23 フリーのアイコンを追加しました。</li>
				<li>2016/09/25 コラムページを作成しました。</li>
				<li>2017/04/20 ヘッダーとフッターを更新しました。</li>
				<li>2017/04/26 ヘッダーとフッターを再構築し、簡単にページが作れるようにしました。</li>
				<li>2017/05/07 管理画面にページ作成画面を追加し、直感的にページを作れるようにしました。</li>
				<li>2017/08/20 レンタルサーバを載せ替えました。</li>
				<li>2017/08/20 ドメインを取得しました。</li>
				<li>2017/08/20 HTTPS通信に変更しました。</li>
				<li>2017/10/23 管理側でディレクトリ名チェック機能を実装しました。</li>
				<li>2018/01/01 管理側でディレクトリ削除機能・ディレクトリ・ディレクトリ名編集機能を実装中です。</li>
				<li>2018/02/18 スマホ用画面の調整を行いました。</li>
				<li>2018/02/18 カスタム版テンプレートを作成しました。(一覧には非表示)</li>
				<li>2018/02/18 ヘッダーの時刻を動的取得に変更しました。</li>
				<li>2018/04/24 Cake PHP3のページを公開しました。</li>
				<li>2018/05/20 画像アップロードページを作成しました。</li>
				<li>2018/05/25 いくつかのページにCSRF対策を実施しました。</li>
				<li>2018/06/16 ドメインをxyzからjpに変更しました。</li>
				<li>2018/10/15 レンタルサーバを乗せ換えました。PHP, Postgresともにバージョンアップしています。</li>
				<li>2018/11/17 SSLをLet's EncryptからGlobalSignのAlphaSSLに変更しました。</li>
				<li>2019/04/25 セキュリティツールのSiteLockを導入しました。</li>
			</ul>
		</fieldset>